// Задача 24: Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36


// Console.WriteLine("Введите целое число");
// int n = Convert.ToInt32(Console.ReadLine());
// int sum=0;
// for (int i =1; i<=n;i++) sum=sum+i;
// Console.WriteLine($"Сумма всех чисел от 1 до {n} равна {sum}");

// void SumNumbers(int x)
// {
//     int sum=0;
//     for (int i =1; i<=x;i++) 
//         sum=sum+i;
//     Console.WriteLine($"Сумма всех чисел от 1 до {x} равна {sum}");
// }

// int SumNumbers2(int x)
// {
//     int sum=0;
//     for (int i =1; i<=x;i++) 
//         sum=sum+i;
//     return sum;
// }


// Console.WriteLine("Введите целое число");
// int n = Convert.ToInt32(Console.ReadLine());
// //SumNumbers(n);
// Console.WriteLine(SumNumbers2(n));




// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5
// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());
// SumNumbers(num);
// int razryad=0;
// while (num % 10 >0)
// {
//     razryad++;
//     num/=10;
// }
// Console.WriteLine(razryad);

// void SumNumbers(int num)
// {
//     int razryad = 0;
//     while (num % 10 > 0)
//     {
//         razryad++;
//         num /= 10;
//     }
//     Console.WriteLine(razryad);
// }

// Console.WriteLine("Введите число: ");
// int x=Convert.ToInt32(Console.ReadLine()) ;
// int a = (int)Math.Log10(x)+1;
// Console.WriteLine($"Число символов {a}");






// Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24 
// 5 -> 120






// Задача 30: Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
// [1,0,1,1,0,1,0,0]
